Repository: paylike/plugin-woocommerce
Catalog: languages/woocommerce-gateway-paylike-*.po
Languages: ro_ro

source: Paylike will not work until you <a href="%s">configure your Paylike api keys</a>.
ro_ro: Paylike nu va funcționa până când nu <a href="%s">configurați cheile API Paylike</a> .

source: WooCommerce Paylike - The minimum PHP version required for this plugin is %1$s. You are running %2$s.
ro_ro: WooCommerce Paylike - Versiunea PHP minimă necesară pentru acest plugin este %1$s. Rulează %2$s.

source: WooCommerce Paylike requires WooCommerce to be activated to work.
ro_ro: WooCommerce Paylike necesită activarea WooCommerce pentru a funcționa.

source: WooCommerce Paylike - The minimum WooCommerce version required for this plugin is %1$s. You are running %2$s.
ro_ro: WooCommerce Paylike - Versiunea minimă necesară pentru acest plugin este %1$s. Rulează %2$s.

source: WooCommerce Paylike - cURL is not installed.
ro_ro: WooCommerce Paylike - cURL nu este instalat.

source: Settings
ro_ro: Setări

source: Unable to capture transaction!
ro_ro: Nu se poate captura tranzacția!

source: cURL request failed.
ro_ro: Cererea cURL a eșuat.

source: Paylike capture complete.
ro_ro: Captura Paylike finalizată.

source: Transaction ID:
ro_ro: ID-ul de tranzacție:

source: Payment Amount:
ro_ro: Suma de plată:

source: Transaction authorized at:
ro_ro: Tranzacție autorizată la:

source: Error :
ro_ro: Eroare:

source: Unable to refund transaction!
ro_ro: Nu se poate rambursa tranzacția!

source: Paylike refund complete.
ro_ro: Rambursare Paylike finalizată.

source: Refund amount:
ro_ro: Suma rambursată:

source: Unable to void transaction!
ro_ro: Nu se poate anula tranzacția!

source: Paylike void complete.
ro_ro: Anulare Paylike finalizată.

source: Voided amount:
ro_ro: Suma anulată:

source: Paylike Transaction Failed (%s)
ro_ro: Tranzacție paylike eșuată (%s)

source: Neither Transaction ID nor Card ID was found
ro_ro: Nici ID-ul tranzacției și nici ID-ul cardului nu au fost găsite

source: Error:
ro_ro: Eroare:

source: The private key doesn't seem to be valid
ro_ro: Cheia privată nu pare să fie valabilă

source: No valid merchant id was found
ro_ro: Nu a fost găsit niciun ID de comerciant valid

source: Merchant ID not found
ro_ro: ID de comerciant (Merchand ID) nu a fost găsit

source: Via %s card ending in %s (%s)
ro_ro: Prin cardul %s care se încheie în %s (%s)

source: Paylike enables you to accept credit and debit cards on your WooCommerce platform. If you don't already have an account with Paylike, you can create it <a href="https://paylike.io/">here</a>. Need help with the setup? Read our documentation <a href="https://paylike.io/plugins/woocommerce/">here</a>.
ro_ro: Paylike vă permite să acceptați carduri de credit și debit pe platforma WooCommerce. Dacă nu aveți deja un cont cu Paylike, îl puteți crea <a href="https://paylike.io/">aici</a> . Aveți nevoie de ajutor pentru configurare? Citiți documentația noastră <a href="https://paylike.io/plugins/woocommerce/">aici</a> .

source: Continue to payment
ro_ro: Continuați la plată

source: TEST MODE ENABLED. In test mode, you can use the card number 4100 0000 0000 0000 with any CVC and a valid expiration date. "<a href="%s">See Documentation</a>".
ro_ro: MOD DE TEST ACTIV. În modul de testare, puteți utiliza cardul 4100 0000 0000 0000 cu orice CVC și o dată valabilă de expirare. &quot; <a href="%s">Vezi documentație</a> &quot;.

source: The test private key is not valid or set to live mode.
ro_ro: Cheia privată de test nu este validă sau este setată în modul live.

source: The test public key doesn't seem to be valid
ro_ro: Cheia publică de test nu pare să fie validă

source: The live private key doesn't seem to be valid
ro_ro: Cheia privată live nu pare să fie validă

source: The live private key is not valid or set to test mode.
ro_ro: Cheia privată live nu este validă sau este setată în modul de testare.

source: The live public key doesn't seem to be valid
ro_ro: Cheia publică live nu pare să fie validă

source: The transaction id is missing, it seems that the authorization failed or the reference was not sent. Please try the payment again. The previous payment will not be captured.
ro_ro: ID-ul tranzacției lipsește, se pare că autorizarea a eșuat sau referința nu a fost trimisă. Încercați din nou plata. Plata anterioară nu va fi capturată.

source: Unable to verify transaction!
ro_ro: Nu se poate verifica tranzacția!

source: Paylike authorization complete.
ro_ro: Autorizație Paylike finalizată.

source: Authorized amount:
ro_ro: Suma autorizată:

source: Captured amount:
ro_ro: Suma capturată:

source: Charge authorized at:
ro_ro: Plată autorizată la:

source: Paylike transaction refunded.
ro_ro: Tranzacție Paylike rambursată.

source: Paylike: <a href="%s">Force SSL</a> is disabled; your checkout page may not be secure! Unless you have a valid SSL certificate and force the checkout pages to be secure, only test mode will be allowed.
ro_ro: Paylike: <a href="%s">Force SSL</a> este dezactivat; este posibil ca pagina dvs. de checkout să nu fie sigură! Cu excepția cazului în care aveți un certificat SSL valid și forțați ca paginile de verificare să fie sigure, numai modul de testare va fi permis.

source: Thank you for your order, please click below to pay and complete your order.
ro_ro: Vă mulțumim pentru comanda dvs., vă rugăm să faceți clic mai jos pentru a plăti și finaliza comanda.

source: Pay Now
ro_ro: Plătește acum

source: Enable/Disable
ro_ro: Activare/Dezactivare

source: Enable Paylike
ro_ro: Activați Paylike

source: Payment method title
ro_ro: Titlul metodei de plată

source: This controls the title which the user sees during checkout.
ro_ro: Aceasta controlează titlul pe care utilizatorul îl vede în timpul plății.

source: Credit card (Paylike)
ro_ro: Card de credit (Paylike)

source: Payment method description
ro_ro: Descrierea metodei de plată

source: This controls the description which the user sees during checkout.
ro_ro: Aceasta controlează descrierea pe care utilizatorul o vede în timpul plății.

source: Secure payment with credit card via &copy; <a href="https://paylike.io" target="_blank">Paylike</a>
ro_ro: Plata sigură cu cardul de credit prin © <a href="https://paylike.io" target="_blank">Paylike</a>

source: Payment popup title
ro_ro: Titlu popup de plată

source: The text shown in the popup where the customer inserts the card details.
ro_ro: Textul afișat în fereastra pop-up unde clientul introduce detaliile cardului.

source: Transaction mode
ro_ro: Mod de tranzacție

source: In test mode, you can create a successful transaction with the card number 4100 0000 0000 0000 with any CVC and a valid expiration date.
ro_ro: În modul de testare, puteți crea o tranzacție reușită cu numărul cardului 4100 0000 0000 0000 cu orice CVC și o dată valabilă de expirare.

source: Live mode App Key
ro_ro: Cheia aplicației în modul live

source: Get it from your Paylike dashboard
ro_ro: Ia-l din tabloul de bord Paylike

source: Live mode Public Key
ro_ro: Cheie publică în modul live

source: Test mode App Key
ro_ro: Cheie de aplicație test

source: Test mode Public key
ro_ro: Cheie publică test

source: Compatibility Mode
ro_ro: Mod de compatibilitate

source: Don't capture from processing to completed
ro_ro: Nu captura de la În procesare la Finalizată

source: When this is checked you can capture payment by moving an order to On Hold and then to complete or processing status, when its not checked you can also complete them from processing to complete as well as the other 2 options
ro_ro: Când acest checkbox este bifat, puteți capta o plată mutând o comandă în În așteptare și apoi la starea de Finalizată sau În procesare, atunci când nu este bifat, puteți captura și de la În procesare la Finalizată, precum și celelalte 2 opțiuni

source: Checkout mode
ro_ro: Mod checkout

source: Payment before order created
ro_ro: Plata înainte de crearea comenzii

source: Redirect to payment page after order created
ro_ro: Redirecționați la pagina de plată după crearea comenzii

source: Capture mode
ro_ro: Mod de capturare

source: If you deliver your product instantly (e.g. a digital product), choose Instant mode. If not, use Delayed. In Delayed mode, you can capture the order when moving from on hold to complete or from on hold to processing.
ro_ro: Dacă livrați produsul instantaneu (de exemplu, un produs digital), alegeți modul instant. Dacă nu, folosiți Întârziat. În modul Întârziat, puteți captura comanda când treceți de la În așteptare la Finalizată sau de la În așteptare la În procesare.

source: Logging
ro_ro: Logare

source: Log debug messages
ro_ro: Jurnalizează mesajele de depanare

source: Save debug messages to the WooCommerce System Status log.
ro_ro: Salvați mesajele de depanare în jurnalul de stare a sistemului WooCommerce.

source: Allow customers to pay with credit cards via the Paylike gateway in your WooCommerce store.
ro_ro: Permiteți clienților să plătească cu carduri de credit prin intermediul gateway-ului Paylike din magazinul dvs. WooCommerce.
