Repository: paylike/plugin-woocommerce
Catalog: woocommerce-gateway-paylike/languages/woocommerce-gateway-paylike-*.po
Languages: hu_hu

source: %s ending in %s
hu_hu: %s végződik %s

source: <b>Warning:</b> Order has not been captured!
hu_hu: <b>Figyelmeztetés:</b> A rendelés nem került terhelésre!

source: Accepted Cards
hu_hu: Elfogadott kártyák

source: Allow customers to pay with credit cards via Paylike in your WooCommerce store.
hu_hu: A vásárlók bankkártyával fizethetnek WooCommerce webáruházában a Paylike fizetési megoldás segítségével.

source: Allow users to reuse their card via Paylike
hu_hu: Engedélyezze a felhasználóknak egy korábbi kártya ismételt használatát

source: Authorized amount:
hu_hu: Engedélyezett összeg:

source: Capture mode
hu_hu: Elfogadási mód

source: Captured amount:
hu_hu: Rögzített összeg:

source: Charge authorized at:
hu_hu: Fizetés engedélyezési idő:

source: Checkout mode
hu_hu: Pénztár mód

source: Compatibility Mode
hu_hu: Kompatibilitási mód

source: Compatibility mode is enabled. This means that moving the order from processing to completed does not actually capture the order.
hu_hu: Kompatibilitás mód engedélyezve. Ez azt jelenti, hogy a rendelés teljesítettre állításával a terhelés nem történik meg.

source: Continue to payment
hu_hu: Tovább a fizetéshez

source: Credit card (Paylike)
hu_hu: Bankkártya (Paylike)

source: Delayed
hu_hu: Késleltetett

source: Don't capture from processing to completed
hu_hu: Ne vonja le az összeget automatikusan, amikor a Feldolgozás alatt állapotról a Teljesítve állapotra vált

source: Enable Paylike
hu_hu: Paylike bekapcsolása

source: Enable/Disable
hu_hu: Bekapcsol/Kikapcsol

source: Error :
hu_hu: Hiba :

source: Error:
hu_hu: Hiba:

source: Get it from your Paylike dashboard
hu_hu: Szerezze be a Paylike oldaláról

source: If you choose the latter, then you can come back to the order move it back to processing, then move it again to completed.
hu_hu: Amennyiben az utóbbi opciót választja, a rendelést később visszateheti feldolgozás alattira majd ismét teljesítettre állíthatja.

source: If you deliver your product instantly (e.g. a digital product), choose Instant mode. If not, use Delayed. In Delayed mode, you can capture the order when moving from on hold to complete or from on hold to processing.
hu_hu: Ha a terméket azonnal szállítja (pl. digitális termék), akkor válassza az azonnali módot. Ha nem, akkor a késletetettet. A késletetettet módban akkor lesz a megrendelés összege a kártyán ténylegesen levonva, amikor a Fizetésre vár állapot után a Feldolgozás alatt vagy Teljesítve állapotra vált.

source: In test mode, you can create a successful transaction with the card number 4100 0000 0000 0000 with any CVC and a valid expiration date.
hu_hu: A teszt üzemmódban a következő kártyaszámmal tudja a rendszert tesztelni: 4100 0000 0000 0000, tetszőleges CVC és lejárati dátummal.

source: Live
hu_hu: Élő

source: Live mode App Key
hu_hu: Elő módhoz App Key

source: Live mode Public Key
hu_hu: Élő módhoz Public Key

source: Merchant ID not found
hu_hu: Merchant ID nem található

source: Neither Transaction ID nor Card ID was found
hu_hu: Se tranzakció ID se kártya ID nem található

source: Network issues! Check your connection and try again.
hu_hu: Hálózati hiba! Ellenőrizze a internetkapcsolatát és próbálja újra.

source: No valid merchant id was found
hu_hu: Érvényes Merchant ID nem található

source: Pay Now
hu_hu: Fizetés

source: Paylike authorization complete.
hu_hu: Paylike engedélyezés sikeres.

source: Paylike capture complete.
hu_hu: Paylike elszámolás sikeres.

source: Paylike enables you to accept credit and debit cards on your WooCommerce platform. If you don't already have an account with Paylike, you can create it <a href="https://paylike.io/">here</a>. Need help with the setup? Read our documentation <a href="https://paylike.io/plugins/woocommerce/">here</a>.
hu_hu: A Paylike segítségével Ön bank és hitelkártyákat tud elfogadni WooCommerce webáruházában. Ha még nincs fiókja a Paylike-nál, akkor tud készíteni egyet <a href="https://paylike.io/">itt</a>. Segítségre van szüksége a telepítéshez? A dokumentáció megtalálható <a href="https://paylike.io/plugins/woocommerce/">itt</a>.

source: Paylike refund complete.
hu_hu: Paylike visszafizetés sikeres.

source: Paylike Transaction Failed (%s)
hu_hu: Paylike tranzakció sikertelen (%s)

source: Paylike transaction refunded.
hu_hu: Paylike tranzakció visszafizetve.

source: Paylike void complete.
hu_hu: Paylike érvénytelenítés sikeres.

source: Paylike will not work until you <a href="%s">configure your Paylike api keys</a>.
hu_hu: Paylike nem működik addig, míg nem <a href="%s">állítja be a Paylike api kulcsokat</a>.

source: Paylike: <a href="%s">Force SSL</a> is disabled; your checkout page may not be secure! Unless you have a valid SSL certificate and force the checkout pages to be secure, only test mode will be allowed.
hu_hu: Paylike: <a href="%s">Force SSL</a> ki van kapcsolva; a fizetési oldala lehetséges, hogy nem biztonságos. Csak teszt üzemmód használható.

source: Payment Amount:
hu_hu: Összeg:

source: Payment before order created
hu_hu: A fizetés történjen meg a megrendelés létrehozása előtt

source: Payment method description
hu_hu: Fizetési mód leírása

source: Payment method title
hu_hu: Fizetési mód címe

source: Payment popup title
hu_hu: Fizetés felugró ablak címe

source: Redirect to payment page after order created
hu_hu: Megrendelés rögzítése után menjen a fizetés oldalra

source: Refund amount:
hu_hu: Visszafizetett összeg:

source: Save payment information to my account for future purchases.
hu_hu: Mentse el a fizetési információt a számlámhoz későbbi vásásrláshoz.

source: Secure payment with credit card via &copy; <a href="https://paylike.io" target="_blank">Paylike</a>
hu_hu: Biztonságos bankkártyás fizetés &copy; <a href="https://paylike.io" target="_blank">Paylike</a>

source: Select the card types to accept.
hu_hu: Válassza ki a kártya típust.

source: Settings
hu_hu: Beállítások

source: Store Payment Method
hu_hu: Fizetési mód mentése

source: Test
hu_hu: Teszt

source: Test mode App Key
hu_hu: Teszt módhoz App Key

source: TEST MODE ENABLED. In test mode, you can use the card number 4100 0000 0000 0000 with any CVC and a valid expiration date. "<a href="%s">See Documentation</a>".
hu_hu: TESZT ÜZEMMÓD! Valódi pénzügyi terhelés nem történik. A következő kártyaszámmal tudja a rendszert tesztelni: 4100 0000 0000 0000, tetszőleges CVC és lejárati dátummal. "<a href="%s">Lásd a dokumentációban</a>".

source: Test mode Public key
hu_hu: Teszt módhoz Public Key

source: Thank you for your order, please click below to pay and complete your order.
hu_hu: Köszönjük a megrendelést, kérjük nyomja meg itt a gombot a fizetés elindításához.

source: The action is not allowed! You do not have the rights to perform the action. Reach out to hello@paylike.io to get help.
hu_hu: Ez a funkció nincs engedélyezve! Kérjük lépjen velünk kapcsolatba a hello@paylike.hu címen.

source: The app key doesn't seem to be valid
hu_hu: Az app key nem tűnik érvényesnek

source: The card could not be fetched.
hu_hu: A kártya elfogadása sikertelen

source: The live app key doesn't seem to be valid
hu_hu: Az app key nem tűnik érvényesnek

source: The live app key is not valid.
hu_hu: Érvénytelen app key

source: The live public key doesn't seem to be valid
hu_hu: Az élő privát kulcs nem tűnik érvényesnek

source: The merchant couldn't be found
hu_hu: A kereskedő nem található

source: The merchant is not allowed to capture
hu_hu: A kereskedő nem használhatja a terhelés funkciót

source: The merchant is not allowed to save cards
hu_hu: A kereskedő nem mentheti el a kártyaadatokat

source: The operation is not properly authorized! Check the credentials set in settings for Paylike.
hu_hu: A művelet nincs megfelelően hitelesítve! Ellenőrizze Paylike számlája adatait.

source: The operation leads to a conflict! The same transaction is being requested for modification at the same time. Try again later.
hu_hu: A művelet hibát eredményez! Ugyanannak a tranzakciónak a módosítása zajlik egy időben. Próbálja újra később.

source: The Paylike account used is not allowed to capture. Instant mode is not available.
hu_hu: A Paylike számla nincs engedélyezve tranzakciók terheléséhez. Az instant mód nem elérhető.

source: The Paylike account used is not allowed to save cards. Storing the payment method is not available.
hu_hu: A Paylike számla nincs engedélyezve kártyák mentésére. A fizetési mód tárolása nem lehetséges.

source: The request is not valid! Check if there is any validation bellow this message and adjust if possible, if not, and the problem persists, contact the developer.
hu_hu: Érvénytelen kérelem! Ellenőrizze, hogy van-e bármi hitelesítés az üzenet alatt és végezze el a szükséges változtatást. Ha a probléma továbbra is fenn áll, lépjen kapcsolatba a fejlesztővel.

source: The test app key is not valid.
hu_hu: Érvénytelen teszt app key.

source: The test public key doesn't seem to be valid
hu_hu: A teszt publikus kulcs nem tűnik érvényesnek

source: The text shown in the popup where the customer inserts the card details.
hu_hu: Ez a szöveg látszódik a felugró ablakban, amikor a felhasználó megadja a kártya adatait.

source: The transaction could not be fetched.
hu_hu: A tranzakció sikertelen

source: The transaction id is missing, it seems that the authorization failed or the reference was not sent. Please try the payment again. The previous payment will not be captured.
hu_hu: A tranzakció azonosító hiányzik, úgy tűnik, hogy a fizetés sikertelen volt. Kérjük próbálja újra a fizetést. A korábbi fizetési kísérlet nem kerül levonásra.

source: There has been a server issue! If this problem persists contact the developer.
hu_hu: Szerverprobléma! Ha a probléma továbbra is fenn áll, lépjen kapcsolatba a fejlesztővel.

source: There was a problem adding the payment method.
hu_hu: Probléma jelentkezett a fizetési mód hozzáadásakor.

source: There was a problem creating the transaction!.
hu_hu: Probléma jelentkezett a tranzakció létrehozásakor.

source: This controls the description which the user sees during checkout.
hu_hu: Ez kontrolálja a leírást, amit a felhasználó a pénztár során lát.

source: This controls the title which the user sees during checkout.
hu_hu: Ez kontrolálja a címet, amit a felhasználó a pénztár során lát.

source: Tokenization is only compatible with the before order payment mode.
hu_hu: A tokenizálás kizárólag a rendelés előtti fizetési móddal kompatibilis.

source: Transaction authorized at:
hu_hu: Tranzakció engedélyezési idő:

source: Transaction ID:
hu_hu: Tranzakció ID:

source: Transaction mode
hu_hu: Tranzakció módja

source: Transaction not found! Check the transaction key used for the operation.
hu_hu: A tranzakció nem található! Ellenőrizze a használt tranzakció azonosítóját.

source: Unable to capture transaction!
hu_hu: Tranzakció elszámolása sikertelen!

source: Unable to refund transaction!
hu_hu: Tranzakció visszafizetése sikertelen!

source: Unable to verify transaction!
hu_hu: Tranzakció ellenőrzés sikertelen!

source: Unable to void transaction!
hu_hu: Tranzakció érvénytelenítés sikertelen!

source: Use Beta
hu_hu: Béta mód használata

source: Use the Beta SDK(only use if instructed)
hu_hu: Béta SDK használata (csak ha javasolták)

source: Via %s card ending in %s (%s)
hu_hu: %s kártya által, végződése: %s (%s)

source: Voided amount:
hu_hu: Érvénytelenített összeg:

source: When this is checked the beta version of the sdk is being used
hu_hu: Az opció engedélyezésével a béta SDK kerül bekapcsolásra

source: When this is checked users are allowed to save their payment to be used as a source for future payments without the need to go trough the payment process again
hu_hu: Az opció engedélyezésével a felhasználók elmenthetik a kártyáikat jövőbeli fizetések elvégzéséhez a kártyaadatok ismételt megadása nélkül

source: When this is checked you can capture payment by moving an order to On Hold and then to complete or processing status, when its not checked you can also complete them from processing to complete as well as the other 2 options
hu_hu: Amikor ez az opció be van kapcsolva, akkor a rendszer automatikusan levonja az összeget, amikor a Fizetésre vár állapotra vált és utána a Feldolgozás alatt vagy Teljesítve állapotra vált

source: WooCommerce Paylike - cURL is not installed.
hu_hu: WooCommerce Paylike - cURL nincs telepítve.

source: WooCommerce Paylike - The minimum PHP version required for this plugin is %1$s. You are running %2$s.
hu_hu: WooCommerce Paylike - A minimális PHP verzió mely a plugin múködéséhez kell %1$s. Jelenlegi verzió %2$s.

source: WooCommerce Paylike - The minimum WooCommerce version required for this plugin is %1$s. You are running %2$s.
hu_hu: WooCommerce Paylike - A minimális WooCommerce verzió mely a plugin működéséhez kell %1$s. Jelenlegi verzió %2$s.

source: WooCommerce Paylike requires WooCommerce to be activated to work.
hu_hu: WooCommerce Paylike működéséhez szükséges az aktivált WooCommerce.

source: You can either move the order to on hold and then to processing or go to settings and uncheck the `Compatibility Mode` checkbox.
hu_hu: A rendelést átteheti
